package AskingQueriesFP;

import java.util.HashMap;
import java.util.Map;

public class Development {
	Map<String,Integer> events = new HashMap<String, Integer>();

	public Development() {
		super();
		events.put("מרים ראש וחזה תוך השענות על המרפקים ואמות הידיים", 4); 
		events.put("מחזיק ראש יציב בישיבה", 4); 
		events.put("מרים ראש וחזה בשכיבה על הבטן", 4); 
		events.put("מסוגל להעביר את ידו מעבר לקו אמצע של גופו", 5); 
		events.put("מסוגל להעביר משקל מצד לצד בשכיבה על הבטן", 4); 
		events.put("מרים את רגליו לכיוון ידיו בשכיבה על הגב", 5); 
		events.put("לומד 'לשים ראש' בשכיבה על הבטן ולנוח", 4); 
		events.put("מרים ראש וחזה תוך הישענות על כפות הידיים עם מרפקים ישרים", 6); 
		events.put("מתהפך מהגב לבטן", 6); 
		events.put("מתהפך מהבטן לגב", 6); 
		events.put("מרים את האגן בשכיבה על הבטן", 5); 
		events.put("עושה 'כפיפות שמיכה'", 6); 
		events.put("מסתובב על צירו", 6); 
		events.put("מתחיל את שלבי הזחילה של הפרדת רגליים, הרמת אגן או בית חזה", 7); 
		events.put("מתחיל להרים את הטוסיק למעלה, לעמוד על שש, ולדחוף עצמו לקראת זחילה", 8); 
		events.put("יושב ללא תמיכה למספר דקות מעבר משכיבה", 8); 
		events.put("מסוגל לשבת ללא הגבלת זמן בלי להישען", 9); 
		events.put("זוחל לפנים ולאחור", 9); 
		events.put("נושא משקל על רגליו/דוחף רגלים", 9); 
		events.put("מקים עצמו לעמידה", 10); 
		events.put("מתיישב ללא עזרת אדם ממצב עמידה", 10); 
		events.put("זוחל על הידיים והברכיים", 10); 
		events.put("מסוגל לטפס כמה מדרגות ידיים ורגליים", 10); 
		events.put("הליכה סביב רהוט תוך כדי הישענות בהם", 11); 
		events.put("מסוגל לדחוף עגלת ילדים", 18); 
		events.put("הולך עם עזרה", 11); 
		events.put("עומד לבד לרגע", 13); 
		events.put("עולה במדרגות עם עזרה", 15); 
		events.put("הולך ללא עזרה", 16); 
		events.put("טיפוס והחלקה במגלשות", 24); 
		events.put("עושה תנועות סימטריות", 1); 
		events.put("עוקב אחרי תנועות מעבר לקו האמצע/עוקב יפה עם המבט לכל כיוון", 2); 
		events.put("משלב אצבעות, משחק בידיים", 4); 
		events.put("מסובב ראשו בחופשיות לכל הצדדים", 4); 
		events.put("מכניס לפיו את רוב החפצים שבידו", 3); 
		events.put("לופת בידיו חפץ רך ומחזיק לזמן קצר", 3); 
		events.put("אגרופי ידיו פתוחים", 3); 
		events.put("מושיט יד לחפץ ותופס אותו.מנענע וחובט/משתמש באצבעותיו כדי למשש חפצים", 4); 
		events.put("רוכש שליטה  על היד (קשר מח יד). התינוק מכוון את תנועתו בצורה מודעת (כלומר, לא מדובר בתנועה רפלקסיבית, אלא מתוכננת מראש", 5); 
		events.put("משחק ברגליו בשכיבה על גבו", 5); 
		events.put("תופס בידיו את כפות רגליו/ יד ורגל נגדית ומכניס לפה", 6); 
		events.put("מעביר חפץ מיד ליד ", 6); 
		events.put("הפעלה מוטורית של היד: הושטת יד גבוה לקחת חפץ(בשכיבה על הבטן), חבטה והשלכה/ מגלה עניין בהפלתם של חפצים קטנים או בזריקתם על הרצפה", 7); 
		events.put("הפרדה ברורה בין יד ימין ליד שמאל", 8); 
		events.put("תפיסת צבת לא בשלה", 9); 
		events.put("מתחיל למחוא כפיים", 10); 
		events.put("מסוגל לקחת בקבוק להחזיק לבד ולשתות", 10); 
		events.put("תפיסת פינצטה עדינה", 11); 
		events.put("מתכופף ומרים חפצים מהרצפה", 18); 
		events.put("מסוגל להחזיק עיפרון ולשרבט", 4); 
		events.put("זריקתם והפלתם של חפצים, פתיחה וסגירה של דלתות ומגירות, הפעלת מתג חשמלי", 24); 
		events.put("בונה מגדל מ-2 קוביות", 15); 
		events.put("בונה מגדל מ-3 קוביות", 21); 
		events.put("בונה מגדל מ-36 קוביות", 24); 
		events.put("מביט בפנים", 1); 
		events.put("מגיב לקולות חזקים בהפסקת פעילות או בהגברתה", 1); 
		events.put("עוקב במבט אחר עצם נע", 2); 
		events.put("מחייך חיוך חברתי בתגובה לגירוי", 2); 
		events.put("מחייך חיוך ספונטני", 4); 
		events.put("חשש מזרים", 7); 
		events.put("מאכיל את עצמו בעזרת בקבוק", 8); 
		events.put("מגיב לקריאת שמו", 8); 
		events.put("מגיב להוראות ומשחק בקו-קו", 11); 
		events.put("מחביא חפצים", 11); 
		events.put("מנופף לשלום", 11); 
		events.put("מגיב באופן שונה לאנשים מוכרים וזרים", 10); 
		events.put("מצביע על מבוקשו", 12); 
		events.put("מסוגל למצוא חפץ שהחביאו לו תוך כדי משחק", 12); 
		events.put("משמיע קולות בתגובה לגירוי(לא רק בכי)", 3); 
		events.put("צוחק בקול", 4); 
		events.put("משמיע קולות מלמול עיצורים", 5); 
		events.put("מפנה ראש למקור הצליל",5); 
		events.put("משמיע הברות חוזרות", 8); 
		events.put("מחקה קולות", 9); 
		events.put("מבין הנחיות פשוטות שמלוות במחוות", 11); 
		events.put("מגיב להוראה מילולית פשוטה בת כמה מילים", 14); 
		events.put("אומר מילה שאינה אבא או אמא", 12); 
		events.put("אומר לפחות 4-6 מילים", 16); 
		events.put("אומר לפחות 7-10 מילים", 18); 
		events.put("מכיר לפחות חלק אחד בגוף, מצביע תצלומים מספרים", 19); 
		events.put("מצביע על חפצים מוכרים", 20); 
		events.put("אומר כ-20 מילים", 21); 
		events.put("מחבר שתי מילים למשפט", 24); 
		
	}
	
	String[] getDevelopmentEvents() {
		String[] events= {	"מרים ראש וחזה תוך השענות על המרפקים ואמות הידיים",
							"מחזיק ראש יציב בישיבה",
							"מרים ראש וחזה בשכיבה על הבטן",
							"מסוגל להעביר את ידו מעבר לקו אמצע של גופו",
							"מסוגל להעביר משקל מצד לצד בשכיבה על הבטן",
							"מרים את רגליו לכיוון ידיו בשכיבה על הגב",
							"לומד 'לשים ראש' בשכיבה על הבטן ולנוח",
							"מרים ראש וחזה תוך הישענות על כפות הידיים עם מרפקים ישרים",
							"מתהפך מהגב לבטן",
							"מתהפך מהבטן לגב",
							"מרים את האגן בשכיבה על הבטן",
							"עושה 'כפיפות שמיכה'",
							"מסתובב על צירו",
							"מתחיל את שלבי הזחילה של הפרדת רגליים, הרמת אגן או בית חזה",
							"מתחיל להרים את הטוסיק למעלה, לעמוד על שש, ולדחוף עצמו לקראת זחילה",
							"יושב ללא תמיכה למספר דקות מעבר משכיבה",
							"מסוגל לשבת ללא הגבלת זמן בלי להישען",
							"זוחל לפנים ולאחור",
							"נושא משקל על רגליו/דוחף רגלים",
							"מקים עצמו לעמידה ",
							"מתיישב ללא עזרת אדם ממצב עמידה",
							"זוחל על הידיים והברכיים",
							"מסוגל לטפס כמה מדרגות ידיים ורגליים",
							"הליכה סביב רהוט תוך כדי הישענות בהם",
							"מסוגל לדחוף עגלת ילדים",
							"הולך עם עזרה",
							"עומד לבד לרגע",
							"עולה במדרגות עם עזרה",
							"הולך ללא עזרה",
							"טיפוס והחלקה במגלשות",
							"עושה תנועות סימטריות",
							"עוקב אחרי תנועות מעבר לקו האמצע/עוקב יפה עם המבט לכל כיוון",
							"משלב אצבעות, משחק בידיים",
							"מסובב ראשו בחופשיות לכל הצדדים",
							"מכניס לפיו את רוב החפצים שבידו[",
							"לופת בידיו חפץ רך ומחזיק לזמן קצר",
							"אגרופי ידיו פתוחים",
							"מושיט יד לחפץ ותופס אותו.מנענע וחובט/משתמש באצבעותיו כדי למשש חפצים",
							"רוכש שליטה  על היד (קשר מח יד). התינוק מכוון את תנועתו בצורה מודעת (כלומר, לא מדובר בתנועה רפלקסיבית, אלא מתוכננת מראש",
							"משחק ברגליו בשכיבה על גבו",
							"תופס בידיו את כפות רגליו/ יד ורגל נגדית ומכניס לפה",
							"מעביר חפץ מיד ליד",
							"הפעלה מוטורית של היד: הושטת יד גבוה לקחת חפץ(בשכיבה על הבטן), חבטה והשלכה/ מגלה עניין בהפלתם של חפצים קטנים או בזריקתם על הרצפה",
							"הפרדה ברורה בין יד ימין ליד שמאל",
							"תפיסת צבת לא בשלה",
							"מתחיל למחוא כפיים",
							"מסוגל לקחת בקבוק להחזיק לבד ולשתות",
							"תפיסת פינצטה עדינה",
							"מתכופף ומרים חפצים מהרצפה",
							"מסוגל להחזיק עיפרון ולשרבט",
							"זריקתם והפלתם של חפצים, פתיחה וסגירה של דלתות ומגירות, הפעלת מתג חשמלי",
							"בונה מגדל מ-2 קוביות",
							"בונה מגדל מ-3 קוביות",
							"בונה מגדל מ-6 קוביות",
							"מביט בפנים",
							"מגיב לקולות חזקים בהפסקת פעילות או בהגברתה",
							"עוקב במבט אחר עצם נע",
							"מחייך חיוך חברתי בתגובה לגירוי",
							"מחייך חיוך ספונטני",
							"חשש מזרים",
							"מגיב לקריאת שמו",
							"מגיב להוראות ומשחק בקו-קו",
							"מחביא חפצים",
							"מנופף לשלום",
							"מגיב באופן שונה לאנשים מוכרים וזרים",
							"מצביע על מבוקשו",
							"מסוגל למצוא חפץ שהחביאו לו תוך כדי משחק",
							"משמיע קולות בתגובה לגירוי(לא רק בכי)",
							"צוחק בקול",
							"משמיע קולות מלמול עיצורים",
							"מפנה ראש למקור הצליל",
							"משמיע הברות חוזרות",
							"מחקה קולות",
							"מבין הנחיות פשוטות שמלוות במחוות",
							"מגיב להוראה מילולית פשוטה בת כמה מילים",
							"אומר מילה שאינה אבא או אמא",
							"אומר לפחות 4-6 מילים",
							"אומר לפחות 7-10 מילים",
							"מכיר לפחות חלק אחד בגוף, מצביע תצלומים מספרים ",
							"מצביע על חפצים מוכרים",
							"אומר כ-20 מילים",
							"מחבר שתי מילים למשפט"
							};
		return events;
	}

	
	Integer getMonthEvent(String event) {
		return events.get(event);
		
	}
}
